In [2]:
import pandas as pd
import numpy as np

In [3]:
# creating 2 Pandas Series
series1 = pd.Series([1, 2, 3, 4, 5])
series2 = pd.Series([6, 7, 8, 9, 10])
  
series3 = series1 + series2

# displaying the result
print(series3)

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [10]:
print(series3.index.values)

[0 1 2 3 4]

In [15]:
df = pd.DataFrame({'month': [2, 5, 8, 10],
                   'year': [2017, 2019, 2018, 2019],
                   'sale': [60, 45, 90, 36]})
print(df)
df.set_index('month', inplace = True)
print(df)

   month  year  sale
0      2  2017    60
1      5  2019    45
2      8  2018    90
3     10  2019    36
       year  sale
month
2      2017    60
5      2019    45
8      2018    90
10     2019    36

In [16]:
left = pd.DataFrame({'key': ['A', 'B'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['A', 'B'], 'rval': [4, 5]})
pd.merge(left, right, on='key')

  key  lval  rval
0   A     1     4
1   B     2     5

In [31]:
data=pd.DataFrame({'Name':pd.Series(["Ana", "Priya", "Charu", "Suchi","Richa"]),
                  'Marks1':pd.Series([45,65,78,12,4]),
                  'Marks2':pd.Series([23,67,45,99,67]),
                  'Marks3':pd.Series([0,67,68,69,70]),
                  'Marks4': pd.Series([89,89,87,86,100]),
                  'Marks5': pd.Series([45,47,49,50,89]),
                  'Total': pd.Series([])
                  })
data

<ipython-input-31-38ea1c484cb8>:7: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  'Total': pd.Series([])

    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
0    Ana      45      23       0      89      45    NaN
1  Priya      65      67      67      89      47    NaN
2  Charu      78      45      68      87      49    NaN
3  Suchi      12      99      69      86      50    NaN
4  Richa       4      67      70     100      89    NaN

In [32]:
data.loc[:,'Total']= data.Marks1+data.Marks2+data.Marks3+data.Marks4+data.Marks5
print(data)

    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
0    Ana      45      23       0      89      45    202
1  Priya      65      67      67      89      47    335
2  Charu      78      45      68      87      49    327
3  Suchi      12      99      69      86      50    316
4  Richa       4      67      70     100      89    330

In [33]:
data.loc[(data["Total"] > 250)]

    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
1  Priya      65      67      67      89      47    335
2  Charu      78      45      68      87      49    327
3  Suchi      12      99      69      86      50    316
4  Richa       4      67      70     100      89    330

In [34]:
data.loc[(data["Total"] > 250) & (data["Marks1"]>50)]

    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
1  Priya      65      67      67      89      47    335
2  Charu      78      45      68      87      49    327

In [54]:
#max of every row
maxValues = data.max(axis = 1)
print(maxValues)
print("\n")

#max of total
print(data[data.Total == data.Total.max()])
print("\n")

#max of marks1
print(data[data.Marks1 == data.Marks1.max()])
print("\n")

#max of marks1 and total
print( data[ (data.Marks1 == data.Marks1.max()) & (data.Total == data.Total.max()) ] )

0    202
1    335
2    327
3    316
4    330
dtype: int64


    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
1  Priya      65      67      67      89      47    335


    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
2  Charu      78      45      68      87      49    327


Empty DataFrame
Columns: [Name, Marks1, Marks2, Marks3, Marks4, Marks5, Total]
Index: []

In [53]:
print("Mean of Total" , data.Total.mean())
print("Mean of Marks1" , data.Marks1.mean())
print(data[data.Total > data.Total.mean()])
print("\n")
print(data[data.Marks1 > data.Marks1.mean()])
print("\n")
print(data[ (data.Marks1 > data.Marks1.mean()) & (data.Total > data.Total.mean()) ])

Mean of Total 302.0
Mean of Marks1 40.8
    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
1  Priya      65      67      67      89      47    335
2  Charu      78      45      68      87      49    327
3  Suchi      12      99      69      86      50    316
4  Richa       4      67      70     100      89    330


    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
0    Ana      45      23       0      89      45    202
1  Priya      65      67      67      89      47    335
2  Charu      78      45      68      87      49    327


    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
1  Priya      65      67      67      89      47    335
2  Charu      78      45      68      87      49    327